app/controllers/dm_profiles_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    redirect_to '/unauthorized' if current_user.blocked_by? User.find(params[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def new
    @tutorial = params[:tutorial] if params[:tutorial] == "true"
    @user = User.find(params[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "dm_profiles" ("user_id", "bio", "experience_level", "max_distance", "online_play", "homebrew", "original_ruleset", "advanced_ruleset", "pathfinder", "third", "three_point_five", "fourth", "fifth", "original_campaign", "module", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.find(params[:user_id])
    @dm_profile = DmProfile.new(dm_profile_params)
    respond_to do |format|
      if @dm_profile.save

SELECT  "dm_profiles".* FROM "dm_profiles" WHERE "dm_profiles"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
---
    def set_dm_profile
      @dm_profile = DmProfile.where(user_id: params[:user_id])[0]