app/controllers/player_profiles_controller.rb

  def show
    redirect_to '/unauthorized' if current_user.blocked_by? User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def new
    @tutorial = params[:tutorial] if params[:tutorial] == "true"
    @user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def edit
    @user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    @user = User.find(params[:user_id])
    @player_profile = PlayerProfile.new(player_profile_params)
    respond_to do |format|
      if @player_profile.save
        @user.update(player_profile: @player_profile)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "player_profiles" ("user_id", "bio", "experience_level", "max_distance", "online_play", "homebrew", "original_ruleset", "advanced_ruleset", "pathfinder", "third", "three_point_five", "fourth", "fifth", "original_campaign", "module", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "player_profiles" SET "user_id" = ?, "updated_at" = ? WHERE "player_profiles"."id" = ?  [["user_id", 1], ["updated_at", 2017-03-05 20:57:03 UTC], ["id", 2]]

    def set_player_profile
      @player_profile = PlayerProfile.where(user_id: params[:user_id])[0]
---
SELECT  "player_profiles".* FROM "player_profiles" WHERE "player_profiles"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]