app/controllers/users_controller.rb

  def show
    #get their chats
    @user = current_user
    @dm_profile = @user.dm_profile
    @player_profile = @user.player_profile
    @conversations = @user.chat_rooms
    @new_conversations = @user.chat_rooms
    @similar_profiles = []
    if !@user.player_profile.nil? && @user.dm_profile.nil?
      similar_players = recommend_set(User.recommender(@user.player_profile), @user)
      @similar_profiles << similar_players.first
---
SELECT  "dm_profiles".* FROM "dm_profiles" WHERE "dm_profiles"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT  "player_profiles".* FROM "player_profiles" WHERE "player_profiles"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]

  def edit
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "profile_pic_path", "age", "last_active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "max_distance" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["max_distance", 20.0], ["updated_at", 2017-03-22 19:17:06 UTC], ["id", 1]]

  def destroy
    @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]

    def set_user
      @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]