app/views/player_profiles/show.html.erb

        <% unless current_user? @user %>
          <% if within_distance(User.find(@player_profile.user_id), current_user) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]