app/views/dm_profiles/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
            <strong>Distance:</strong>
            <%= find_distance(User.find(@dm_profile.id), current_user) %>